app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews" ORDER BY "reviews"."created_at" DESC
---
    def index
        @reviews=Review.all.order(created_at: :desc)

INSERT INTO "reviews" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "ねばねば"], ["created_at", "2024-09-07 03:34:30.353450"], ["updated_at", "2024-09-07 03:34:30.353450"]]
---
    def create
        @review=Review.new(name: params[:name], content: params[:content], user_id: @current_user.id)
        if @review.save