app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at", "image_name", "password") VALUES (?, ?, ?, ?, ?)  [["name", "ナットー"], ["created_at", "2024-09-21 05:01:01.167758"], ["updated_at", "2024-09-21 05:01:01.167758"], ["image_name", "userimg.jpg"], ["password", "[FILTERED]"]]
---
    def create
        @user=User.new(name: params[:name], image_name: "userimg.jpg", password: params[:password])
        if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ?, "image_name" = ? WHERE "users"."id" = ?  [["name", "ナット"], ["updated_at", "2024-09-21 05:04:11.535387"], ["image_name", "1.jpg"], ["id", 1]]
---
    def update
        @user=User.find_by(id: params[:id])
        @user.name=params[:name]
        if params[:image]
            @user.image_name="#{@user.id}.jpg"
            image=params[:image]
            File.binwrite("public/user_images/#{@user.image_name}", image.read)
        end
        if @user.save